rpi5-64/20240810-0028-new/logs/pgbench-no-no-yes-512-1000-1000-1723748865/pgbench.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 5
partition method: range
partitions: 1000
query mode: prepared
number of clients: 4
number of threads: 4
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 319061
number of failed transactions: 0 (0.000%)
latency average = 0.125 ms
initial connection time = 5.306 ms
tps = 31917.625455 (without initial connection time)